results/a2_container/a2_glm_45_air_fp8_random64_ngram/20260605T115009Z/bench_stdout.log
INFO 06-05 19:53:28 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 06-05 19:53:28 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 06-05 19:53:28 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 06-05 19:53:28 [__init__.py:239] Platform plugin ascend is activated
INFO 06-05 19:53:36 [__init__.py:110] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 06-05 19:53:36 [__init__.py:110] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffef3b01b20>, trust_remote_code=False, seed=0, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=256, random_range_ratio=0.1, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=19007, endpoint='/v1/completions', header=None, max_concurrency=4, model='glm-4.5-air-fp8', input_len=None, output_len=None, tokenizer='/models/GLM-4.5-Air-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/root/Benchmark-Experiments/results/a2_container/a2_glm_45_air_fp8_random64_ngram/20260605T115009Z', result_filename='a2_glm_45_air_fp8_random64_ngram.json', ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-373835f1-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 06-05 19:53:38 [datasets.py:631] Sampling input_len from [921, 1127] and output_len from [230, 282]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 64/64 [03:02<00:00,  2.86s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  182.86    
Total input tokens:                      65663     
Total generated tokens:                  16423     
Request throughput (req/s):              0.35      
Output token throughput (tok/s):         89.81     
Peak output token throughput (tok/s):    24.00     
Peak concurrent requests:                7.00      
Total token throughput (tok/s):          448.91    
---------------Time to First Token----------------
Mean TTFT (ms):                          552.98    
Median TTFT (ms):                        380.25    
P99 TTFT (ms):                           3200.39   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          41.69     
Median TPOT (ms):                        40.47     
P99 TPOT (ms):                           64.92     
---------------Inter-token Latency----------------
Mean ITL (ms):                           188.74    
Median ITL (ms):                         186.80    
P99 ITL (ms):                            210.29    
---------------Speculative Decoding---------------
Acceptance rate (%):                     96.81     
Acceptance length:                       4.73      
Drafts:                                  3455      
Draft tokens:                            13308     
Accepted tokens:                         12883     
Per-position acceptance (%):
  Position 0:                            99.83     
  Position 1:                            92.33     
  Position 2:                            90.39     
  Position 3:                            90.33     
==================================================
sys:1: DeprecationWarning: builtin type swigvarlink has no __module__ attribute